In [1]:
import pandas as pd

print(pd.__version__)

2.3.3

## 2. Create a Sample DataFrame
The DataFrame contains three columns:
- `Name` (text)
- `Age` (numeric)
- `Country` (text)

In [5]:
data = {
    'Name':    ['Alice', 'Bob', 'Carlos', 'Dina', 'Emma'],
    'Age':     [23, 35, 42, 29, 31],
    'Country': ['USA', 'UK', 'Germany', 'India', 'USA']
}

df = pd.DataFrame(data)
df

     Name  Age  Country
0   Alice   23      USA
1     Bob   35       UK
2  Carlos   42  Germany
3    Dina   29    India
4    Emma   31      USA

## 3. Create a New Numeric Column Using a Lambda Function
I create a new column called **`Age_times_2`** by multiplying the `Age` column by 2.

I use `DataFrame.apply()` with a `lambda` function:

```python
df['Age_times_2'] = df['Age'].apply(lambda x: x * 2)

In [6]:
df['Age_times_2'] = df['Age'].apply(lambda x: x * 2)
df

     Name  Age  Country  Age_times_2
0   Alice   23      USA           46
1     Bob   35       UK           70
2  Carlos   42  Germany           84
3    Dina   29    India           58
4    Emma   31      USA           62

## 4. Create a Flag / Label Column from the Text Column Using a Lambda Function
Now I use the `Country` column to create:
- A **`Region`** label column (e.g. 'North America', 'Europe', 'Asia')
- An **`Is_Europe`** boolean flag column (`True` / `False`)

Both are created with `lambda` functions applied to the `Country` column.

In [7]:
# Map each country to a region label
region_map = {
    'USA': 'North America',
    'UK': 'Europe',
    'Germany': 'Europe',
    'India': 'Asia'
}

# Label-style flag column using a lambda
df['Region'] = df['Country'].apply(lambda c: region_map.get(c, 'Other'))

# Boolean flag column using a lambda (True if the row is in Europe)
df['Is_Europe'] = df['Region'].apply(lambda r: r == 'Europe')

df

     Name  Age  Country  Age_times_2         Region  Is_Europe
0   Alice   23      USA           46  North America      False
1     Bob   35       UK           70         Europe       True
2  Carlos   42  Germany           84         Europe       True
3    Dina   29    India           58           Asia      False
4    Emma   31      USA           62  North America      False

## 5. Summary
- This notebook is intended to be run in the `20th_century` virtual environment.
- I created a DataFrame with names, ages, and countries.
- I used a **lambda** function to create `Age_times_2`, a numeric column based on `Age`.
- I used **lambda** functions on the text-based `Country` column to derive:
  - `Region` (a label/flag column), and
  - `Is_Europe` (a Boolean flag column).